app/controllers/alternatives_controller.rb

  def index
    @alternatives = Alternative.all
---
SELECT "alternatives".* FROM "alternatives"

  def create
    @alternative = Alternative.new(alternative_params)

    if @alternative.save
---
INSERT INTO "alternatives" ("enunciado", "correta", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["enunciado", ""], ["correta", false], ["created_at", "2022-11-01 19:50:18.421002"], ["updated_at", "2022-11-01 19:50:18.421002"]]

    def set_alternative
      @alternative = Alternative.find(params[:id])
---
SELECT "alternatives".* FROM "alternatives" WHERE "alternatives"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]