app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @Question=Question.find_by(id: params["id"])

INSERT INTO "questions" ("alternativaCorreta", "assunto_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["alternativaCorreta", "a"], ["assunto_id", 0], ["created_at", "2022-11-01 20:40:05.393269"], ["updated_at", "2022-11-01 20:40:05.393269"]]
---
  def create
    @question = Question.new(question_params)

    if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_question
      @question = Question.find(params[:id])